import React, { useState } from 'react';
import '../../webpage/mainWeb/Courseww.css';

const Course1 = () => {
  const [activeModule, setActiveModule] = useState(1);

  const moduleContent = {
    1: {
      description: "На першому модулі учні знайомляться з мінімальним обсягом теорії по Java (змінні, алгоритмічні конструкції), у тому числі з об'єктно-орієнтованим підходом. Відбувається ознайомлення з інструментами ігрової спрямованості: таймер, робота з зображеннями, анімація руху, робота з клавіатурою, генерація псевдовипадкових чисел. Озброївшись необхідними знаннями, починаємо процес створення невеликої комп'ютерної гри - 'Новорічний дощ'.",
      program: [
        "Знайомство з мовою програмування Java",
        "Робота зі змінними",
        "Основні алгоритмічні конструкції",
        "Основи об`єктно-орієнтованого програмування",
        "Основи комп`ютерної графіки мови Java",
        "Робота з графічними зображеннями",
        "Конструктори класів, обробники подій",
        "Створення комп`ютерної гри 'Новорічний дощ (початок)'",
        "Створення комп`ютерної гри 'Новорічний дощ (продовження)'",
        "Створення комп`ютерної гри 'Новорічний дощ (продовження)'",
        "Створення комп`ютерної гри 'Новорічний дощ' (закінчення)'",
        "Блок-схеми та формальний запис програм"
      ],
      learnText: [
        "Установлювати програмне забезпечення для роботи з мовою програмування java.",
        "Роботі зі змінними, типами даних.",
        "Основним алгоритмічним конструкціям, таким як умовні оператори та цикли.",
        "Засвоять основи об'єктно-орієнтованого програмування.",
        "Роботі з графікою та створенню анімації.",
        "Обробці подій клавіатури та створенню невеликої комп`ютерної 2D гри 'Новорічний дощ'.",
        "Ознайомимо з формальним методом запису алгоритмів (блок-схемами)."
      ]
    },
    2: {
      description: "У другому модулі продовжуємо вивчення Java. Вивчаємо роботу з мишею, операції з файлами, інтерфейсу користувача візуальними засобами розробки та 'вручну'. Бази даних (mySQL) та їх підключення до java-програм у магічному застосунку 'Передбачення майбутнього'. Створення вебсторінки та програмування javaScript-ефектів, розробка калькулятора, робота з реєстром Windows та створення мега-цікавого застосунку 'Блокувальник Windows' - усе це та ще багато іншого очікує на наших юних розробників у рамках другого модуля.",
      program: [
        "Обробка подій, пов'язаних з пристроєм керування 'миша'",
        "Проєктування інтерфейсу користувача",
        "Створення застосунку 'калькулятор'. Продовження",
        "Верстка вебсторінки за допомогою html і css",
        "Використання javascript на вебсторінці",
        "Створення вітального блокувальника windows. Реалізація інтерфейсу",
        "Створення вітального блокувальника windows. Завершення",
        "Візуальні засоби розробки. Створення інтерфейсу програми",
        "Робота з файловою системою з java. Створення, видалення, перейменування файлів",
        "Робота з файловою системою з java. Читання і запис у файл",
        "Бази даних. Мова запитів sql. Робота з базою даних mysql з java",
        "Створення гри 'передбачення майбутнього' з використанням бази даних"
      ],
      learnText: [
       " Працювати з базами даних mySQL з мови java.",
        "Працювати з реєстром Windows, розуміти принципи програм-блокувальників та шкідливого програмного забезпечення.",
        "Роботі з файловою системою з java.",
        "Обробці подій миші, напишемо міні-Paint.",
        "Ознайомимось з візуальними засобами розробки та принципами побудови інтерфейсу користувача.",
        "Навчимося робити міні вебсторінки з застосуванням HTML, CSS та javaScript"
      ]
    },
    3: {
      description: "Третій модуль занурює школярів у веброзробку, створення сайту на прикладі клієнт-серверного проєкту інтернет-магазину 'Вінні-Пух і компанія', вивчення основних моментів, які знадобляться веброзробнику-початківцю. Також до java додаються вивчення мов: PHP, javaScript, HTML (мова розмітки), CSS (каскадні таблиці стилів).",
      program: [
        "Робимо інтернет-магазин"
      ],
      learnText: [
        "Ознайомимось із клієнт-серверними додатками;",
        "Вивчимо принципи передачі даних за протоколом HTTP;",
        "Навчимось працювати з серверною мовою php, створимо невеликий інтернет-магазин;",
        "Навчимося працювати з javascript, HTML, CSS;",
        "Більш детально вивчимо роботу з базами даних mysql;",
        "Створимо власний невеликий інтернет-магазин."
      ]
    },
    4: {
      description: "Останній, четвертий модуль, це чиста практика. Учням пропонується самостійно написати три відомі комп'ютерні ігри: Змійка, Морський бій, Пасьянс-Косинка. Викладач є помічником, який дає рекомендації і підказує в скрутних ситуаціях, але не дає готових рішень. Таким чином в учнів є шанс відчути себе справжнім програмістом, якому видають лише технічне завдання.",
      program: [
       "1-3 Розробка гри «Змійка»",
      "4-7 Розробка гри «Морський бій»",
      "8-12 Розробка гри «Пасьянс косинка»"
      ],
      learnText: [
        "Розумінню проєктного програмування.",
        "Роботі з двовимірними масивами, списками.",
        "Принципам розробки ігор.",
        "Самостійно створювати 2d ігри типу Змійки, Морського бою та Пасьянс-косинки."
      ]
    }
  };

  return (
    <section id="course" className="sectionCourse">
      <div className="course-containerT">
        <div className="course-headerT">
          <h1>Курс Java для школярів</h1>
        </div>

        <div className="tabsT">
          <button 
            className={`tabT ${activeModule === 1 ? 'activeT' : ''}`}
            onClick={() => setActiveModule(1)}
          >
            Модуль 1. Базовий
          </button>
          <button 
            className={`tabT ${activeModule === 2 ? 'activeT' : ''}`}
            onClick={() => setActiveModule(2)}
          >
            Модуль 2. Хакерський
          </button>
          <button 
            className={`tabT ${activeModule === 3 ? 'activeT' : ''}`}
            onClick={() => setActiveModule(3)}
          >
            Модуль 3. Юний бізнесмен
          </button>
          <button 
            className={`tabT ${activeModule === 4 ? 'activeT' : ''}`}
            onClick={() => setActiveModule(4)}
          >
            Модуль 4. GameDev
          </button>
        </div>

        <p>{moduleContent[activeModule].description}</p>

        <div className="programsT">
          <div className="programT">
            <h3>Програма курсу:</h3>
            <ul>
              {moduleContent[activeModule].program.map((item, index) => (
                <li key={index}>{item}</li>
              ))}
            </ul>
          </div>

          <div className="learnT">
            <h3>Ми навчимо вашу дитину:</h3>
            <ul>
              {moduleContent[activeModule].learnText.map((item, index) => (
                <li key={index}>{item}</li>
              ))}
            </ul>
          </div>
        </div>
      </div>
    </section>
  );
}

export default Course1;
